---
kind: method
id: M:Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet.Erase(Autodesk.Revit.DB.Electrical.TemperatureRatingType)
source: html/f1ed2c5d-e719-18b9-9c67-1dc66104a359.htm
---
# Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet.Erase Method

Removes a specified TemperatureRating type from the set.

## Syntax (C#)
```csharp
public virtual int Erase(
	TemperatureRatingType item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.TemperatureRatingType`) - The TemperatureRating type to be erased.

## Returns
The number of TemperatureRating types that were erased from the set.